# AI Development Extensions - Added 2025-01-09
continue.continue
codeium.codeium
github.copilot-labs
ms-toolsai.vscode-ai
huggingface.huggingface-vscode
tabnine.tabnine-vscode
amazonwebservices.aws-toolkit-vscode
ms-toolsai.jupyter-ai
charliermarsh.ruff
ms-python.black-formatter
ms-python.isort
bradlc.vscode-tailwindcss
prisma.prisma
graphql.vscode-graphql
golang.go
hashicorp.terraform
redhat.vscode-yaml
ms-vscode.vscode-json

# Original Extensions
aaron-bond.better-comments@3.0.2
atommaterial.a-file-icon-vscode@2.0.1
christian-kohler.path-intellisense@2.10.0
danielsanmedium.dscodegpt@3.14.85
davidanson.vscode-markdownlint@0.60.0
dbaeumer.vscode-eslint@3.0.16
eamodio.gitlens@17.4.1
esbenp.prettier-vscode@11.0.0
github.copilot@1.364.0
github.copilot-chat@0.30.3
humao.rest-client@0.25.1
ms-python.debugpy@2025.10.0
ms-python.python@2025.12.0
ms-python.vscode-pylance@2025.7.1
ms-python.vscode-python-envs@1.2.0
ms-toolsai.jupyter@2025.7.0
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.3.0
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
njpwerner.autodocstring@0.6.1
oderwat.indent-rainbow@8.3.1
redhat.java@1.45.0
rust-lang.rust-analyzer@0.3.2593
samuelcolvin.jinjahtml@0.20.0
stylelint.vscode-stylelint@1.5.3
visualstudioexptteam.intellicode-api-usage-examples@0.2.9
visualstudioexptteam.vscodeintellicode@1.3.2
vmware.vscode-spring-boot@1.63.0
vscjava.vscode-gradle@3.17.0
vscjava.vscode-java-debug@0.58.2
vscjava.vscode-java-dependency@0.24.1
vscjava.vscode-java-pack@0.29.2
vscjava.vscode-java-test@0.43.1
vscjava.vscode-maven@0.44.0
yzhang.markdown-all-in-one@3.6.3
