# VS Code Extensions Configuration
# This file lists VS Code extensions to be managed by the installation script
# Run: ../scripts/manage-vscode-extensions.sh install

# AI Development Extensions
continue.continue
tabnine.tabnine-vscode
github.copilot
github.copilot-chat
ms-toolsai.vscode-ai
huggingface.huggingface-vscode
danielsanmedium.dscodegpt
codeium.codeium

# Cloud & Infrastructure
amazonwebservices.aws-toolkit-vscode
hashicorp.terraform

# Code Quality & Formatting
aaron-bond.better-comments
davidanson.vscode-markdownlint
yzhang.markdown-all-in-one
dbaeumer.vscode-eslint
esbenp.prettier-vscode
stylelint.vscode-stylelint

# File Management & Navigation
atommaterial.a-file-icon-vscode
christian-kohler.path-intellisense

# Visual Enhancements
oderwat.indent-rainbow

# Data & Configuration
redhat.vscode-yaml

# Version Control
eamodio.gitlens

# IntelliCode & API Usage
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode

# HTTP & REST
humao.rest-client

# Python Development
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.vscode-python-envs
ms-python.black-formatter
ms-python.isort
charliermarsh.ruff
njpwerner.autodocstring
tamasfe.even-better-toml

# Java Development
redhat.java
vscjava.vscode-java-pack
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-gradle
vmware.vscode-spring-boot

# Go Development
golang.go

# Rust Development
rust-lang.rust-analyzer

# Web Development
bradlc.vscode-tailwindcss
prisma.prisma
graphql.vscode-graphql

# Template Languages
samuelcolvin.jinjahtml

# Jupyter & Data Science
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
